Revit 2027 API
VertexIndexPair.Top Property
The index of the vertex pair from the top profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Top { get; set; }
Public Property Top As Integer
	Get
	Set
public:
property int Top {
	int get ();
	void set (int value);
}
member Top : int with get, set
Property Value
Int32
See Also
Reference
VertexIndexPair Class
Autodesk.Revit.DB Namespace